app/Controllers/Bpsi.php

INSERT INTO `bpsi` (`ph`, `tds`, `suhu`, `kualitas_limbah`) VALUES ('5', '122', '24', 'Baik')
---
    public function create()
    {
        $bpsi = new Modelsbpsi();
        //   $key = $this->request->getVar("key");


        $data = [
            'ph' => $this->request->getVar('ph'),
            'tds' => $this->request->getVar('tds'),
            'suhu' => $this->request->getVar('suhu'),
            'kualitas_limbah'  => $this->request->getVar('kualitas_limbah'),
        ];

        $bpsi->insert($data);

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
SELECT *
FROM `bpsi`
WHERE DATE_FORMAT(waktu, "%H:%i") >= '15:20'
AND DATE_FORMAT(waktu, "%H:%i") < '15:21'
SELECT *
FROM `bpsi`
WHERE `tanggal` IS NULL
---
    public function halaman_tabel(): string
    {
        $bpsi = new Modelsbpsi();
        $time = $this->request->getVar('waktu');
        $fdate = $this->request->getVar('tanggal_mulai');
        if ($fdate == null && $time == null) {
            $data = $bpsi->orderBy('id', 'DESC')->findAll();
        } //clear
        elseif ($fdate == null && $time != null) {
            // dd($time);
            $data = $bpsi->where('DATE_FORMAT(waktu, "%H:%i") >=', $time)
                ->where('DATE_FORMAT(waktu, "%H:%i") <', date('H:i', strtotime($time) + 60)) // 60 seconds in 1 minute
                ->find();
        } elseif ($fdate != null && $time == null) {
            $data = $bpsi->where('tanggal', $fdate)->find();
        } // clear
        elseif ($fdate != null && $time != null) {
            // dd($time);
            $data = $bpsi->where('tanggal', $fdate)->where('DATE_FORMAT(waktu, "%H:%i") >=', $time)
                ->where('DATE_FORMAT(waktu, "%H:%i") <', date('H:i', strtotime($time) + 60)) // 60 seconds in 1 minute
                ->find();
        } else {
            $data = $bpsi->orderBy('id', 'DESC')->findAll();
        }
        $ldate = $this->request->getVar('tanggal_akhir');
        $filterByDate = $bpsi->where('tanggal', $fdate)->find();

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
 LIMIT 7
---
    public function search(): string
    {
        $bpsi = new Modelsbpsi();
        $fdate = $this->request->getVar('tanggal_mulai');
        $ldate = $this->request->getVar('tanggal_akhir');
        $filterByDate = $bpsi->where('tanggal', $fdate)->find();
        // dd($filterByDate);
        $data = $bpsi->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
 LIMIT 7
SELECT *
FROM `bpsi`
WHERE DATE_FORMAT(waktu, "%H") >= '12'
AND DATE_FORMAT(waktu, "%H") < '13'
 LIMIT 7
---
    public function halaman_charts_ph()
    {

        $bpsi = new ModelsBpsi();
        $data = $bpsi->orderBy('id', 'desc')->limit(7)->find();
        // $pagi = $bpsi->where('DATE_FORMAT(waktu, "%H") >=', '04')->where('DATE_FORMAT(waktu, "%H") <', '11')->limit(7)->findAll();
        $siang = $bpsi->where('DATE_FORMAT(waktu, "%H") >=', '12')->where('DATE_FORMAT(waktu, "%H") <', '13')->limit(7)->find();

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
 LIMIT 7
SELECT *
FROM `bpsi`
WHERE DATE_FORMAT(waktu, "%H") >= '12'
AND DATE_FORMAT(waktu, "%H") < '13'
 LIMIT 7
---
    public function halaman_charts_tds()
    {

        $bpsi = new ModelsBpsi();
        $data = $bpsi->orderBy('id', 'desc')->limit(7)->find();
        $siang = $bpsi->where('DATE_FORMAT(waktu, "%H") >=', '12')->where('DATE_FORMAT(waktu, "%H") <', '13')->limit(7)->find();

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
 LIMIT 7
SELECT *
FROM `bpsi`
WHERE DATE_FORMAT(waktu, "%H") >= '12'
AND DATE_FORMAT(waktu, "%H") < '13'
 LIMIT 7
---
    public function halaman_charts_suhu()
    {

        $bpsi = new ModelsBpsi();
        $data = $bpsi->orderBy('id', 'desc')->limit(7)->find();
        $siang = $bpsi->where('DATE_FORMAT(waktu, "%H") >=', '12')->where('DATE_FORMAT(waktu, "%H") <', '13')->limit(7)->find();