app/Controllers/Home.php

SELECT *
FROM `bpsi`
ORDER BY `waktu` DESC
 LIMIT 1
---
    public function index()
    {
        $session = session();
        // echo "welcome ".$session->get('username');
        $bpsi = new Bpsi();
        $latestUsers = $bpsi->orderBy('waktu', 'desc')->limit(0)->first();

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
---
    public function export(): string
    {
        $bpsi = new Bpsi();
        $data = $bpsi->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `bpsi`
ORDER BY `id` DESC
---
    public function print(): string
    {
        $bpsi = new Bpsi();
        $data = $bpsi->orderBy('id', 'DESC')->findAll();